&НаКлиенте
Процедура ДвиженияДенежныхСредствПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		ТипРегистратора = ТипЗнч(Элемент.ТекущиеДанные.Регистратор);
		
		Если ТипРегистратора = Тип("ДокументСсылка.ВводНачальныхОстатковДенежныхСредств") Тогда
			СтрИмяФормы = "Документ.ВводНачальныхОстатковДенежныхСредств.Форма.ФормаДокумента";
		ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.РасходДенежныхСредств") Тогда
			СтрИмяФормы = "Документ.РасходДенежныхСредств.Форма.ФормаДокумента";
		ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.ПриходДенежныхСредств") Тогда
			СтрИмяФормы = "Документ.ПриходДенежныхСредств.Форма.ФормаДокумента";
		ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.ПеремещениеДенежныхСредств") Тогда
			СтрИмяФормы = "Документ.ПеремещениеДенежныхСредств.Форма.ФормаДокумента";
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.Регистратор);
		ОткрытьФорму(СтрИмяФормы, ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДокумента(ВыбранныйЭлемент, СписокПараметров) Экспорт
	
    Если ВыбранныйЭлемент <> Неопределено Тогда
        
		ОткрытьФорму(ВыбранныйЭлемент.Значение, , ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	СписокЗначенийТипов = Новый СписокЗначений;
	РасходДС = СписокЗначенийТипов.Добавить("Документ.РасходДенежныхСредств.Форма.ФормаДокумента", "Расход денежных средств");
	ПриходДС = СписокЗначенийТипов.Добавить("Документ.ПриходДенежныхСредств.Форма.ФормаДокумента", "Приход денежных средств");
	ПеремещениеДС = СписокЗначенийТипов.Добавить("Документ.ПеремещениеДенежныхСредств.Форма.ФормаДокумента", "Перемещение денежных средств");
	
	ТекущийТипДС = Неопределено;
	ТипРегистратора = ТипЗнч(Элементы.ДвиженияДенежныхСредств);
	Если ТипРегистратора = Тип("ДокументСсылка.ВводНачальныхОстатковДенежныхСредств") Тогда
		
	ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.РасходДенежныхСредств") Тогда
		ТекущийТипДС = РасходДС;
	ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.ПриходДенежныхСредств") Тогда
		ТекущийТипДС = ПриходДС;
	ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.ПеремещениеДенежныхСредств") Тогда
		ТекущийТипДС = ПеремещениеДС;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораДокумента", ЭтаФорма);
	СписокЗначенийТипов.ПоказатьВыборЭлемента(Оповещение, "Выберите тип документа.");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРедактироватьДокумент(Команда)
Перем Отказ;

	Отказ = Ложь;

	ДвиженияДенежныхСредствПередНачаломИзменения(Элементы.ДвиженияДенежныхСредств, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСозданияДокумента(Команда)
Перем Элемент, Отказ, Копирование, Родитель, Группа;
	
	ДвиженияДенежныхСредствПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствПриИзменении(Элемент)
	
	//Элементы.ОстаткиДенежныхСредств.Обновить();
	
КонецПроцедуры
