Перем мВалютаРегламентированногоУчета Экспорт;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	МестоРасходовДенежныхСредств = Константы.ОсновноеМестоРасходаДенежныхСредств.Получить();
	СчетУчета = Константы.ОсновнойСчетУчета.Получить();
	Если ЗначениеЗаполнено(СчетУчета) Тогда
		ВалютаДокумента = СчетУчета.ВалютаСчета;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Расшифровка.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыДвижений(ТаблицаПланируемыеРасходы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетНаОплату.Дата КАК Период,
	               |	СчетНаОплату.СчетУчета,
	               |	СчетНаОплату.ПлановаяДатаПлатежа,
	               |	СчетНаОплатуРасшифровка.Ссылка КАК СчетНаОплату,
	               |	СУММА(СчетНаОплатуРасшифровка.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов
	               |ИЗ
	               |	Документ.СчетНаОплату.Расшифровка КАК СчетНаОплатуРасшифровка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплату КАК СчетНаОплату
	               |		ПО СчетНаОплатуРасшифровка.Ссылка = СчетНаОплату.Ссылка
	               |ГДЕ
	               |	СчетНаОплатуРасшифровка.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплату.Дата,
	               |	СчетНаОплату.СчетУчета,
	               |	СчетНаОплату.ПлановаяДатаПлатежа,
	               |	СчетНаОплатуРасшифровка.Ссылка";

	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	МассивРезультатов = Запрос.ВыполнитьПакет();

	ТаблицаПланируемыеРасходы	= МассивРезультатов[0].Выгрузить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
Перем ТаблицаПланируемыеРасходы, ТаблицаДвиженийДенежныхСредств, ТаблицаИсторияЦенПокупок;
	
	ЗаполнитьТаблицыДвижений(ТаблицаПланируемыеРасходы);
	
	Если ТаблицаПланируемыеРасходы.Количество() <> 0 Тогда
		
		Движения.ПланируемыеРасходы.Записывать = Истина;
		Движения.ПланируемыеРасходы.Загрузить(ТаблицаПланируемыеРасходы);
		
	КонецЕсли;

КонецПроцедуры

мВалютаРегламентированногоУчета = Константы.ОсновнаяВалютаУчета.Получить();
