
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокНеОплаченыхСчетов.УсловноеОформление.Элементы.Очистить();
	
	//http://help1c.by/spisok-uslovnoe-oformlenie/
	
	//////ЭлементОформления = СписокНеОплаченыхСчетов.УсловноеОформление.Элементы.Добавить();
	//////ЭлементОформления.Использование = Истина;
	//////ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//////ПолеОформления.Использование = Истина;
	//////ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ПлановаяДатаПлатежа");
	//////ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//////ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//////ЭлементОтбора.Использование = истина;
	//////ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	//////ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПлановаяДатаПлатежа");
	//////СписокВыбранныеСотрудники.Добавить(ТекДанные.Сотрудник);
	//	ЭлементОтбора.ПравоеЗначение = СписокВыбранныеСотрудники;
	//	
	//	Оформление = ЭлементОформления.Оформление;
	//	Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветТекста"), WebЦвета.СветлоСерый);
	
	//СписокВыбранныеСотрудники = Новый СписокЗначений;
	//Если Не ЕстьУслофноеОформление Тогда
	//	ЕстьУслофноеОформление = Истина;
	//	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	//	ЭлементОформления.Использование = Истина;
	//	
	//	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//	ПолеОформления.Использование = Истина;
	//	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Сотрудник");
	//	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//	ПолеОформления.Использование = Истина;
	//	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Подразделение");
	//	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//	ПолеОформления.Использование = Истина;
	//	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Должность");
	//	
	//	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.Использование = истина;
	//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
	//	СписокВыбранныеСотрудники.Добавить(ТекДанные.Сотрудник);
	//	ЭлементОтбора.ПравоеЗначение = СписокВыбранныеСотрудники;
	//	
	//	Оформление = ЭлементОформления.Оформление;
	//	Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветТекста"), WebЦвета.СветлоСерый);
	//Иначе
	//	ЭлементыОформления = Список.УсловноеОформление.Элементы;
	//	ЭлементОФормления = ЭлементыОформления[0];
	//	ОтборЭлементФормления = ЭлементОФормления.Отбор;
	//	ЭлементыОтбора = ОтборЭлементФормления.Элементы;
	//	ЭлементОтбора = ЭлементыОтбора[0];
	//	СписокВыбранныеСотрудники.ЗагрузитьЗначения(ЭлементОтбора.ПравоеЗначение.ВыгрузитьЗначения());
	//	СписокВыбранныеСотрудники.Добавить(ТекДанные.Сотрудник);
	//	ЭлементОтбора.ПравоеЗначение = СписокВыбранныеСотрудники;
	//КонецЕсли; 	
КонецПроцедуры
