
&НаКлиенте
Процедура ПриОкончанииРедактированияСтандартногоПериода(ВыбранныйПериод, Парам2) Экспорт
	
	Отчет.НачалоПериода = ВыбранныйПериод.ДатаНачала;
	Отчет.КонецПериода = ВыбранныйПериод.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьИнтервал(Команда)
	
	ПеременнаяТипаСтандартныйПериод = Новый СтандартныйПериод;
	ПеременнаяТипаСтандартныйПериод.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПеременнаяТипаСтандартныйПериод.ДатаНачала = Отчет.НачалоПериода;
	ПеременнаяТипаСтандартныйПериод.ДатаОкончания = ?(Отчет.КонецПериода=Дата(1,1,1), Отчет.КонецПериода, КонецДня(Отчет.КонецПериода));
	
	ДопПараметр = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПриОкончанииРедактированияСтандартногоПериода",ЭтотОбъект,ДопПараметр);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = ПеременнаяТипаСтандартныйПериод;
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.КонецПериода = ТекущаяДата();
	Отчет.НачалоПериода = НачалоМесяца(Отчет.КонецПериода);
	
КонецПроцедуры
