
&НаКлиенте
Процедура КомандаИскатьСоответствия(Команда)
	
	КомандаИскатьСоответствияНаСервере(Объект.НачальнаяДата, Объект.КонечнаяДата, Объект.СчетУчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомандаИскатьСоответствияНаСервере(НачальнаяДата, КонечнаяДата, СчетУчета)

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ДЕНЬ) КАК Период,
		|	ДвиженияДенежныхСредствОбороты.Регистратор,
		|	ДвиженияДенежныхСредствОбороты.СуммаРасходаОборот
		|ПОМЕСТИТЬ ВведенныеДокументы
		|ИЗ
		|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ), КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ), Регистратор, СчетУчета = &СчетУчета) КАК ДвиженияДенежныхСредствОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияТранзакций.СчетУчета,
		|	ИсторияТранзакций.Транзакция,
		|	ИсторияТранзакций.ДатаТранзакции,
		|	ИсторияТранзакций.ДатаФиксацииТранзакции,
		|	ИсторияТранзакций.Валюта,
		|	ИсторияТранзакций.МестоПлатежа1,
		|	ИсторияТранзакций.МестоПлатежа2,
		|	ИсторияТранзакций.Город,
		|	ИсторияТранзакций.Страна,
		|	ИсторияТранзакций.Сумма1,
		|	ИсторияТранзакций.Сумма2,
		|	ИсторияТранзакций.ДатаЗагрузки,
		|	ИсторияТранзакций.ДокументТранзакции
		|ПОМЕСТИТЬ ТранзакцииПоСчету
		|ИЗ
		|	РегистрСведений.ИсторияТранзакций КАК ИсторияТранзакций
		|ГДЕ
		|	ИсторияТранзакций.СчетУчета = &СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВведенныеДокументы.Регистратор,
		|	ТранзакцииПоСчету.СчетУчета,
		|	ТранзакцииПоСчету.Транзакция
		|ПОМЕСТИТЬ НайденныеСоответствияВПеровмПриближении
		|ИЗ
		|	ВведенныеДокументы КАК ВведенныеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТранзакцииПоСчету КАК ТранзакцииПоСчету
		|		ПО ВведенныеДокументы.Период = ТранзакцииПоСчету.ДатаТранзакции
		|			И ВведенныеДокументы.СуммаРасходаОборот = ТранзакцииПоСчету.Сумма2
		|ГДЕ
		|	НЕ ТранзакцииПоСчету.СчетУчета ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НайденныеСоответствияВПеровмПриближении.СчетУчета,
		|	НайденныеСоответствияВПеровмПриближении.Транзакция,
		|	НайденныеСоответствияВПеровмПриближении.Регистратор
		|ИЗ
		|	НайденныеСоответствияВПеровмПриближении КАК НайденныеСоответствияВПеровмПриближении
		|ГДЕ
		|	НЕ НайденныеСоответствияВПеровмПриближении.Регистратор В
		|				(ВЫБРАТЬ
		|					НайденныеСоответствияВПеровмПриближении.Регистратор
		|				ИЗ
		|					НайденныеСоответствияВПеровмПриближении КАК НайденныеСоответствияВПеровмПриближении
		|				СГРУППИРОВАТЬ ПО
		|					НайденныеСоответствияВПеровмПриближении.Регистратор
		|				ИМЕЮЩИЕ
		|					КОЛИЧЕСТВО(НайденныеСоответствияВПеровмПриближении.Регистратор) > 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НайденныеСоответствияВПеровмПриближении
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТранзакцииПоСчету
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВведенныеДокументы";

	Запрос.Параметры.Вставить("Дата1", НачальнаяДата);
	Запрос.Параметры.Вставить("Дата2", КонечнаяДата);
	Запрос.Параметры.Вставить("СчетУчета", СчетУчета);
		
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	НачатьТранзакцию();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ИсторияТранзакций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СчетУчета.Установить(ВыборкаДетальныеЗаписи.СчетУчета);
		НаборЗаписей.Отбор.Транзакция.Установить(ВыборкаДетальныеЗаписи.Транзакция);
		
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Запись.ДокументТранзакции = ВыборкаДетальныеЗаписи.Регистратор;
			
		КонецЦикла;

		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
