
Функция НайтиПоКлючуТранзакции(СтрКлючТранзакции) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Транзакции.Ссылка
		|ИЗ
		|	Справочник.Транзакции КАК Транзакции
		|ГДЕ
		|	Транзакции.КлючТранзакции ПОДОБНО &СтрКлючТранзакции";

	Запрос.УстановитьПараметр("СтрКлючТранзакции", СтрКлючТранзакции);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.Транзакции.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМаксимальныйНомерТранзакцииПоКлючу(СтрКлючТранзакции) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Транзакции.НомерТранзакции КАК НомерТранзакции
		|ИЗ
		|	Справочник.Транзакции КАК Транзакции
		|ГДЕ
		|	Транзакции.КлючТранзакции ПОДОБНО &СтрКлючТранзакции
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерТранзакции УБЫВ";

	Запрос.УстановитьПараметр("СтрКлючТранзакции", СтрКлючТранзакции);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерТранзакции;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
