&НаСервереБезКонтекста
Функция ПолучитьВалютуСчета(ПараметрСчетУчета)
	
	Возврат ПараметрСчетУчета.ВалютаСчета;
	
КонецФункции

&НаСервере
Процедура ОбновитьКурсИКратностьДокумента()
	
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	
	Объект.КурсВзаиморасчетов = СтруктураКурса.Курс;
	Объект.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДокументПриИзмененииКурсаИлиКратности()
	
	СтруктураКурсаРеглВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Объект.Дата);
	СтруктураКурсаДокумента = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
	
	Для каждого ТекущаяСтрока Из Объект.Расшифровка Цикл
		ТекущаяСтрока.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСтрока.Сумма, СтруктураКурсаДокумента, СтруктураКурсаРеглВалюты);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	Объект.ВалютаДокумента = ПолучитьВалютуСчета(Объект.СчетУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиДокумента()
	
	Объект.СуммаДокумента = Объект.Расшифровка.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПересчитатьИтогиДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПослеУдаления(Элемент)

	ПересчитатьИтогиДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не Копирование Тогда
		
		ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
		ТекущаяСтрока.Количество = 1;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСуммаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	
	Если ТекущаяСтрока.Количество = 0 Тогда
		ТекущаяСтрока.Количество = 1;
	КонецЕсли;
	
	Если ТекущаяСтрока.Цена = 0 Тогда
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
	Иначе
		ТекущаяСтрока.Количество = ТекущаяСтрока.Сумма / ТекущаяСтрока.Цена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчета = Константы.ОсновнаяВалютаУчета.Получить();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьКурсИКратностьДокумента();
	КонецЕсли;

КонецПроцедуры
