
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтатьяДоходовРасходов = Справочники.СтатьиДоходовИРасходов.ВводОстатков;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиДенежныхСредств Приход
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.СчетУчета = СчетУчета;
	Движение.Сумма = СуммаДокумента;

	// регистр ДвиженияДенежныхСредств Приход
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	Движение = Движения.ДвиженияДенежныхСредств.Добавить();
	Движение.Период = Дата;
	Движение.СчетУчета = СчетУчета;
	Движение.ВалютаДвижения = ВалютаДокумента;
	Движение.СтатьяДоходовРасходов = СтатьяДоходовРасходов;
	Движение.МестоРасходовДенежныхСредств = Справочники.МестаРасходовДенежныхСредств.ПустаяСсылка();
	Движение.СуммаПрихода = СуммаДокумента;
	Движение.СуммаРасхода = 0;
	
КонецПроцедуры
