
&НаСервереБезКонтекста
Функция ПолучитьВалютуСчета(ПараметрСчетУчета)
	
	Возврат ПараметрСчетУчета.ВалютаСчета;
	
КонецФункции

&НаСервере
Процедура ОбновитьКурсИКратностьДокумента()
	
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	
	Объект.КурсВзаиморасчетов = СтруктураКурса.Курс;
	Объект.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчета = Константы.ОсновнаяВалютаУчета.Получить();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьКурсИКратностьДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДокументПриИзмененииКурсаИлиКратности()
	
	СтруктураКурсаРеглВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Объект.Дата);
	СтруктураКурсаДокумента = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
	
	Для каждого ТекущаяСтрока Из Объект.Расшифровка Цикл
		ТекущаяСтрока.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСтрока.Сумма, СтруктураКурсаДокумента, СтруктураКурсаРеглВалюты);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруВидимостиДоступности()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВидимостьСтолбца_СуммаВзаиморасчетов", Объект.ВалютаДокумента <> ВалютаРегламентированногоУчета);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	
	СтруктураВидиомостиДоступности = СформироватьСтруктуруВидимостиДоступности();
	Элементы.РасшифровкаСуммаВзаиморасчетов.Видимость = СтруктураВидиомостиДоступности.ВидимостьСтолбца_СуммаВзаиморасчетов;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	Объект.ВалютаДокумента = ПолучитьВалютуСчета(Объект.СчетУчета);
	ВалютаДокументаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиДокумента()
	
	Объект.СуммаДокумента = Объект.Расшифровка.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПересчитатьИтогиДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПослеУдаления(Элемент)

	ПересчитатьИтогиДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не Копирование Тогда
		
		ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
		Если ТекущаяСтрока.Количество = 0 Тогда
			ТекущаяСтрока.Количество = 1;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
	СтруктураКурсаДокумента = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
	СтруктураКурсаДокументаРегл = УФ_РаботаСКурсамиВалютВызовСервера.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Объект.Дата);
	
	ТекущаяСтрока.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСтрока.Сумма, СтруктураКурсаДокумента, СтруктураКурсаДокументаРегл);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
	СтруктураКурсаДокумента = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
	СтруктураКурсаДокументаРегл = УФ_РаботаСКурсамиВалютВызовСервера.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Объект.Дата);
	
	ТекущаяСтрока.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСтрока.Сумма, СтруктураКурсаДокумента, СтруктураКурсаДокументаРегл);

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСуммаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	
	Если ТекущаяСтрока.Количество = 0 Тогда
		ТекущаяСтрока.Количество = 1;
	КонецЕсли;
	
	Если ТекущаяСтрока.Цена = 0 Тогда
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
	Иначе
		ТекущаяСтрока.Количество = ТекущаяСтрока.Сумма / ТекущаяСтрока.Цена;
	КонецЕсли;
	
	СтруктураКурсаДокумента = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
	СтруктураКурсаДокументаРегл = УФ_РаботаСКурсамиВалютВызовСервера.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Объект.Дата);
	
	ТекущаяСтрока.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСтрока.Сумма, СтруктураКурсаДокумента, СтруктураКурсаДокументаРегл);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСуммаВзаиморасчетовПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	
	СтруктураКурсаДокумента = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
	СтруктураКурсаДокументаРегл = УФ_РаботаСКурсамиВалютВызовСервера.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Объект.Дата);
	
	ТекущаяСтрока.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСтрока.СуммаВзаиморасчетов, СтруктураКурсаДокументаРегл, СтруктураКурсаДокумента);
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ОбновитьКурсИКратностьДокумента();
	ПересчитатьДокументПриИзмененииКурсаИлиКратности();
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьКурсИКратностьДокумента();
	УправлениеВидимостью();
	ПлановаяДатаПлатежаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаПлатежаПриИзменении(Элемент)
	
	Если НачалоДня(Объект.Дата) > НачалоДня(Объект.ПлановаяДатаПлатежа) Тогда
		ПоказатьПредупреждение(, "Дата планового платежа не может быть меньше даты документа.");
		Объект.ПлановаяДатаПлатежа = Объект.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКурсаИлиКратности(Элемент)
	
	ПересчитатьДокументПриИзмененииКурсаИлиКратности();
	
КонецПроцедуры
