////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информационный центр".
//
////////////////////////////////////////////////////////////////////////////////

// Возвращает структуру технических параметров.
//
// Возвращаемое значение:
//	Структура  - структура технических параметров с полями:
//		Имя - Строка - имя параметра.
//		Значение - Строка - значение параметра.
//
Функция ОпределитьСтруктуруТехническихПараметров() Экспорт
	
	СисИнфо = Новый СистемнаяИнформация;

	СтруктураПараметров = Новый Структура("ИмяКонфигурации,СинонимКонфигурации,ВерсияКонфигурации,Логин");
	СтруктураПараметров.ИмяКонфигурации		= Метаданные.Имя;
	СтруктураПараметров.ВерсияКонфигурации	= Метаданные.Версия;
	СтруктураПараметров.СинонимКонфигурации	= Метаданные.Синоним;
	СтруктураПараметров.Логин				= ИмяПользователя();
	
	Возврат СтруктураПараметров;
	
КонецФункции