&НаСервереБезКонтекста
Функция ПолучитьВалютуСчета(ПараметрСчетУчета)
	
	Возврат ПараметрСчетУчета.ВалютаСчета;
	
КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаЗачисления) Тогда
		Объект.ДатаЗачисления = Объект.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаСписанияПриИзменении(Элемент)
	
	Объект.ВалютаСписания = ПолучитьВалютуСчета(Объект.СчетУчетаСписания);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаЗачисленияПриИзменении(Элемент)
	
	Объект.ВалютаЗачисления = ПолучитьВалютуСчета(Объект.СчетУчетаЗачисления);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСписанияПриИзменении(Элемент)
	
	Если Объект.ВалютаЗачисления = Объект.ВалютаСписания Тогда
		Объект.СуммаЗачисления = Объект.СуммаСписания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаЗачисленияПриИзменении(Элемент)

	Если Объект.ВалютаЗачисления = Объект.ВалютаСписания Тогда
		Объект.СуммаСписания = Объект.СуммаЗачисления;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры
