Процедура Пауза(Время)

	ВремяЗавершения = ТекущаяДата() + Время;
	Пока ТекущаяДата() < ВремяЗавершения Цикл
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьТелефонИПарольСервисаПроверкиЧеков(НомерТелефона, Пароль)
	
	НомерТелефона	= "";
	Пароль			= "";
	
	ХранилищеЗначения = ХранилищеОбщихНастроек.Загрузить("СервисПроверкиЧеков", "Параметры");
	
	Если ТипЗнч(ХранилищеЗначения) = тип("ХранилищеЗначения") Тогда
		
		СтруктураПараметров = ХранилищеЗначения.Получить();
		
		НомерТелефона	= СтруктураПараметров.Телефон;
		Пароль			= СтруктураПараметров.Пароль;
		
		Если ПустаяСтрока(НомерТелефона) ИЛИ ПустаяСтрока(Пароль) Тогда
			НомерТелефона	= "";
			Пароль			= "";
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Процедура ПроизвестиДлительноеВычисление(СтруктураПараметров, АдресХранилища) Экспорт
Перем НомерТелефона, Пароль;

	СтруктураВозврата = Новый Структура("ВыполненоУспешно", Ложь);
	
	Описание = "Поиск данных чека на сайте ФНС";
	ПроцентВыполнения = 0;
	ДлительныеОперации.СообщитьПрогресс(Окр(ПроцентВыполнения, 0), Описание);
	
	ПолучитьТелефонИПарольСервисаПроверкиЧеков(НомерТелефона, Пароль);
	
	//GET
	//https://proverkacheka.nalog.ru:9999/v1/ofds/*/inns/*/fss/<номер ФН>/operations/<вид кассового чека>/tickets/<номер ФД>?fiscalSign=<номер ФПД>&date=2018-05-17T17:57:00&sum=3900	
	
	Хост = "proverkacheka.nalog.ru";
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);		
	Соединение = Новый HTTPСоединение(Хост, 9999, НомерТелефона, Пароль, ,30, SSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8");
	Заголовки.Вставить("Content-Charset", "utf-8");		
	Заголовки.Вставить("Device-Id", "windows-pc");
	Заголовки.Вставить("device-os", "windows");
	
	HTTPЗапрос = Новый HTTPЗапрос(
		СтрШаблон(
			"/v1/ofds/*/inns/*/fss/%1/operations/%2/tickets/%3?fiscalSign=%4&date=%5&sum=%6",
			СтруктураПараметров.ФН,
			СтруктураПараметров.ВидЧека,
			СтруктураПараметров.ФД,
			СтруктураПараметров.ФП,
			Формат(СтруктураПараметров.ДатаЧека, "ДФ=yyyy-MM-ddTHH:mm:ss"),
			Формат(СтруктураПараметров.СуммаЧека*100, "ЧДЦ=0; ЧГ=")
		),
		Заголовки
	);
	
	
	HTTPОтвет = Соединение.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 204 Тогда
		Описание = "Чек найден. Запрашиваю данные чека...";
		ПроцентВыполнения = ПроцентВыполнения + 5;
		ДлительныеОперации.СообщитьПрогресс(Окр(ПроцентВыполнения, 0), Описание);
	Иначе
		СообщениеОбОшибке = "Код состояния: " + HTTPОтвет.КодСостояния + Символы.ПС +
							"Текст ответа: " + HTTPОтвет.ПолучитьТелоКакСтроку();
		СтруктураВозврата.Вставить("СообщениеОбОшибке", СообщениеОбОшибке);
		ПоместитьВоВременноеХранилище(СтруктураВозврата, АдресХранилища);
		Возврат;
	КонецЕсли;
	
	Пауза(2);
	
	ПроцентВыполнения = ПроцентВыполнения + 5;
	ДлительныеОперации.СообщитьПрогресс(Окр(ПроцентВыполнения, 0), Описание);
	
	Parameter = "" + СтруктураПараметров.ФН + "/tickets/" + СтруктураПараметров.ФД + "?fiscalSign=" + СтруктураПараметров.ФП + "&sendToEmail=no";
	
	Хост = "proverkacheka.nalog.ru";
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);		
	Соединение = Новый HTTPСоединение(Хост, 9999, НомерТелефона, Пароль, ,30,SSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("Content-Charset", "utf-8");		
	Заголовки.Вставить("Device-Id", "windows-pc");
	Заголовки.Вставить("device-os", "windows");
	
	HTTPЗапрос = Новый HTTPЗапрос("/v1/inns/*/kkts/*/fss/" + Parameter, Заголовки);
	HTTPОтвет = Соединение.Получить(HTTPЗапрос);
	
	Сообщить("Код состояния: " + HTTPОтвет.КодСостояния);
	Сообщить("Текст ответа: " + HTTPОтвет.ПолучитьТелоКакСтроку());

	ТекстОтвета = "";
	
	Пока ПроцентВыполнения <> 100 Цикл
	
		Описание = "Чек найден. Запрашиваю данные чека...";
		ПроцентВыполнения = ПроцентВыполнения + 2;
		ДлительныеОперации.СообщитьПрогресс(Окр(ПроцентВыполнения, 0), Описание);
		
		Пауза(2);
		
	//	Parameter = "" + ПараметрыЧека.fn + "/tickets/" + ПараметрыЧека.i + "?fiscalSign=" + ПараметрыЧека.fp + "&sendToEmail=no";
		
		Хост = "proverkacheka.nalog.ru";
		SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);		
		Соединение = Новый HTTPСоединение(Хост, 9999, НомерТелефона, Пароль, ,30,SSL);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		Заголовки.Вставить("Content-Charset", "utf-8");		
		Заголовки.Вставить("Device-Id", "windows-pc");
		Заголовки.Вставить("device-os", "windows");
		
		HTTPЗапрос = Новый HTTPЗапрос("/v1/inns/*/kkts/*/fss/" + Parameter, Заголовки);
		HTTPОтвет = Соединение.Получить(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 202 Тогда
			
			//Сообщить(СтрШаблон("Ждем получение чека. Осталось %1 попыток...", Сч));
			
		ИначеЕсли HTTPОтвет.КодСостояния = 200 Тогда
			
			ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
			Прервать;
			
		Иначе
			
			СообщениеОбОшибке = "Ошибка:"
								"Код состояния: " + HTTPОтвет.КодСостояния + Символы.ПС +
								"Текст ответа: " + HTTPОтвет.ПолучитьТелоКакСтроку();
			СтруктураВозврата.Вставить("СообщениеОбОшибке", СообщениеОбОшибке);
			ПоместитьВоВременноеХранилище(СтруктураВозврата, АдресХранилища);
			Возврат;
			
		КонецЕсли;
		
		Сч = Сч - 1;
		
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(ТекстОтвета) Тогда
		
		СтруктураВозврата.ВыполненоУспешно = Истина;
		СтруктураВозврата.Вставить("ТекстОтвета", ТекстОтвета);
		
	Иначе
		
		СообщениеОбОшибке = "Чек от сервера ФНС не получен...";
		СтруктураВозврата.Вставить("СообщениеОбОшибке", СообщениеОбОшибке);
		
	КонецЕсли;

	ПоместитьВоВременноеХранилище(СтруктураВозврата, АдресХранилища);
	
КонецПроцедуры
